        IDENTIFICATION DIVISION.
        PROGRAM-ID. FOLHAPAGAMENTO.
        AUTHOR. WESLEY.MENDONCA.
        DATE-WRITTEN. 2021-02-07.

        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
        SOURCE-COMPUTER. IBM-390.
        OBJECT-COMPUTER. IBM-390.
        SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       PROCEDURE DIVISION.
           DISPLAY 'FOLHAPAGAMENTO - INICIO'
           GOBACK.
      *    STOP RUN.
